[
  {
    "path": "posts/2025-08-30-module-2-assignment/",
    "title": "Module 2 Assignment",
    "description": "Introduction to Basic R Functions and Data Structures",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-08-30",
    "categories": [],
    "contents": "\r\nTask 1. Download Import Instructions\r\nI have successfully downloaded the document and read the instructions in the\r\ncheat sheet carefully. The methods in the “readr” and “tidyr” packages to read\r\nand write data files, save data, handle missing values, expand tables, and split\r\ncells all seem very familiar to me.\r\nTask 2. Read Assigned Chapters\r\nI have successfully read the assigned chapters on R Programming and GitHub\r\nTask 3. Evaluate myMean function\r\n\r\n\r\n# Use the vector:\r\n\r\nassignment2 <- c(16, 18, 14, 22, 27, 17, 19, 17, 17, 22, 20, 22)\r\n\r\n# Consider this function:\r\nmyMean <- function(assignment2) {\r\n  return(sum(assignment) / length(someData))\r\n}\r\n\r\n# In RStudio, run myMean(assignment2) and record the output or error.\r\nmyMean(assignment2)\r\n\r\nError in myMean(assignment2): object 'assignment' not found\r\n\r\n# The error message is displayed above.\r\n\r\n\r\nThe function fails because the variable “assignment” does not exist since it has not been created yet. Also, the variable “someData” does not exist. In order to use these two variables, they have to be declared before they are used as arguments for functions. The only variable that can be used in the “myMean” function would be “assignment2” because it is the input variable for the function.\r\nHere is a corrected version of “myMean” that correctly returns the mean of “assignment2”\r\n\r\n\r\n# The corrected function\r\nmyMean <- function(assignment2) {\r\n  return(sum(assignment2) / length(assignment2))\r\n}\r\n\r\n# Call the corrected function\r\nmyMean(assignment2)\r\n\r\n[1] 19.25\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-08-30T15:46:27-04:00",
    "input_file": "module-2-assignment.knit.md"
  },
  {
    "path": "posts/2025-08-25-module-1-assignment-1/",
    "title": "Module 1 Assignment 1",
    "description": "First Post.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-08-25",
    "categories": [],
    "contents": "\r\nThis is my first post for LIS4370\r\nTask #1\r\nCreate a GitHub Repository with a README.md file:\r\n\r\nTask #2 Set Up a Blog\r\nhttps://lis4370-r-programming-journal.netlify.app/\r\nTask #3 Install R and RStudio\r\n\r\nThe installation process of RStudio required me to install R first because\r\nRStudio relies on the R programming language for its functionality. The process\r\nbegan with going to the R project website to download the file for my operating\r\nsystem, and then run the installer. Once it was installed, I was able to go to\r\nthe website that allowed me to download the desktop installer for RStudio.\r\nThe main issue I encountered during installation was that it was difficult to\r\nhave the right Windows installer to be able to download it successfully. This\r\nproblem is what caused me to install RStudio repetitively. The way I resolved\r\nthis problem is that I got the right runtime application that supports the\r\ninstallation requirements for RStudio.\r\nIn terms of my system details, I ran a Windows 11 operating system on my PC, the\r\nR version that I currently have is R 4.4.2, and RStudio version is 2024.12.0.467.\r\nTask #4 Read Foundational Chapters\r\nAn R vector is an object or entity that acts as a container to store data. The\r\nvector is the simplest way to store more than one data value in R programs.\r\nVectors are important for data analysis because they can hold different data\r\ntypes or modes in one container. After storing data types in the container, R\r\nprograms and applications can iterate over the elements in the vector and\r\nperform many different types of operations on the different modes or types of\r\ndata contained in the vector for further analysis and extracting meaning out of\r\nlarge data sets. Elements in vectors can be modified and updated, which makes\r\nthem flexible and versatile, so if data changes, a vector is a good way to keep\r\ntrack of variables.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/R-Programming-Journal-Skylar-Walsh/blob/main/_posts/2025-08-25-module-1-assignment-1/githubrepo.png?raw=true",
    "last_modified": "2025-08-29T13:51:25-04:00",
    "input_file": "module-1-assignment-1.knit.md"
  }
]
